import React from "react";
import styled from "styled-components";

const StyledAbout = styled.div`
  min-height: calc(100vh - 70px);
`;

const Block = styled.p``;


function About() {
    return (
        <StyledAbout>
          <h2>
            Про сторінку
          </h2>
          <h3>
            Тут зібрана основна інформацію про нагороду, випадки з історії та більше
          </h3>
          <hr></hr>
            <Block>
                Оригінальний надпис, що планувалось вигравіювати на ордені, був
                «FOR BRAVERY» («ЗА СМІЛИВІСТЬ»), але пізніше був виправлений на
                «FOR VALOUR» («ЗА МУЖНІСТЬ») за порадою королеви Вікторії, котра
                вважала, що в першому випадку деякі люди можуть вирішити, що
                тільки здобувачі проявили сміливість у бою.
            </Block>
            <Block>
                Перша нагорода Хрестом Вікторії відбулась 26 червня 1857 року,
                за відвагу під час Кримської Війни 1854–1855 рр. Усі ордени
                Хреста Вікторії виливаються із бронзи двох трофейних китайських
                гармат, захоплених у росіян під час облоги Севастополя. Деякі
                історики сумніваються, що ці гармати захоплені в Севастополі.
                <Block>
                    Орден має форму мальтійського хреста, шириною 1,375 дюйму,
                    із зображенням корони, увінчаної левом, та надписом. Стрічка
                    кармазинного кольору, шириною 1,5 дюйми.
                </Block>
            </Block>
            <Block>
                Усього Хрест Вікторії вручався 1355 разів. Найбільше нагород за
                один день — 24 (16 листопада 1857 року) при звільненні міста
                Люкнов в Індії. По закінченні Другої світової війни орден
                вручався всього 12 разів. Чотири останні нагороди були
                розподілені так: дві — учасникам війни за Фолкленди, одну — за
                участь у другій Війні в затоці та одну — за участь в операції
                НАТО в Афганістані. Тільки троє людей отримали нагороду двічі.
                Друга нагорода має вигляд планки, почепленої на стрічці першої
                нагороди, та називається VC and Bar («Хрест із планкою»).
            </Block>
            <Block>
                Єдиним українцем, що отримав Хрест Вікторії, є Пилип Коновал
                (1917 р.).
            </Block>
            <Block>
                Хрестом Вікторії було, як виняток, нагороджено американського
                Невідомого солдата (як взаємність, британський Невідомий солдат
                був нагороджений американською Почесною Медаллю).
            </Block>
            <Block>
                Оскільки Хрестом Вікторії нагороджують за мужність «перед лицем
                ворога», вважається, що зміна характеру сучасної війни на більш
                технологічний матиме наслідком меншу кількість нагород.
            </Block>
            <Block>
                Хоча Австралія, Канада та Нова Зеландія впровадили власні
                системи нагород, Хрест Вікторії залишається найвищою військовою
                нагородою в цих країнах.
            </Block>
        </StyledAbout>
    );
}

export default About;
